---
kind: method
id: M:Autodesk.Revit.DB.XYZ.#ctor
zh: 点
source: html/a50bf8d1-dced-8a0f-78e1-5b45d5022f20.htm
---
# Autodesk.Revit.DB.XYZ.#ctor Method

**中文**: 点

Creates a default XYZ with the values (0, 0, 0).

## Syntax (C#)
```csharp
public XYZ()
```